Repository: davidfvaquero/mood_tracker
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: Mood Tracker
es: Seguimiento del Estado de Ánimo

source: Good Morning
es: Buenos días

source: Good Afternoon
es: Buenas tardes

source: Good Evening
es: Buenas noches

# howAreYouToday
source: How are you feeling today? Record your first mood.
es: ¿Cómo te sientes hoy? Registra tu primer estado de ánimo.

# howAreYouNow
source: How are you feeling now? You already recorded your mood today.
es: ¿Cómo te sientes ahora? Ya registraste tu estado de ánimo hoy.

source: Overall Mood
es: Estado de Ánimo General

source: Specific Emotions
es: Emociones Específicas

# emotionsDescription
source: Select the emotions you feel and their intensity (1-5)
es: Selecciona las emociones que sientes y su intensidad (1-5)

source: Energy and Stress
es: Energía y Estrés

# energyLevel
source: Energy Level: {level}/5
es: Nivel de Energía: {level}/5

# stressLevel
source: Stress Level: {level}/5
es: Nivel de Estrés: {level}/5

source: Activities
es: Actividades

# activitiesDescription
source: Select the activities you did
es: Selecciona las actividades que realizaste

source: Additional Notes
es: Notas Adicionales

# notesPlaceholder
source: Anything specific you want to remember about your mood?
es: ¿Algo específico que quieras recordar sobre tu estado de ánimo?

source: Save Mood Entry
es: Guardar Estado de Ánimo

# moodSavedSuccessfully
source: Mood recorded successfully!
es: ¡Estado de ánimo registrado exitosamente!

source: Quick Check-in
es: Check-in Rápido

# quickCheckinDescription
source: Record your mood quickly
es: Registra tu estado de ánimo de forma rápida

source: Detailed Entry
es: Registro Detallado

# detailedEntryDescription
source: Emotions, activities and more
es: Emociones, actividades y más

source: Cancel
es: Cancelar

source: Save
es: Guardar

source: Today
es: Hoy

source: Yesterday
es: Ayer

source: Recent Entries
es: Entradas recientes

# yourDayToday
source: Your day so far
es: Tu día hasta ahora

# moodScore
source: Mood: {score}/10
es: Estado: {score}/10

# energyScore
source: Energy: {score}/5
es: Energía: {score}/5

# emotions
source: Emotions: {emotions}
es: Emociones: {emotions}

# activitiesLabel
source: Activities: {activities}
es: Actividades: {activities}

# quickLabel
source: Quick
es: Rápido

source: About Quick Check-in
es: Sobre el Check-in Rápido

# quickCheckinInfo
source: • Record your mood in seconds\n• Perfect for multiple daily entries\n• Use quick buttons or customize your selection\n• You can add more details later if you want
es: • Registra tu estado de ánimo en segundos\n• Perfecto para múltiples entradas diarias\n• Usa los botones rápidos o personaliza tu selección\n• Puedes agregar más detalles después si quieres

source: How do you feel now?
es: ¿Cómo te sientes ahora?

source: Very Bad
es: Muy mal

source: Bad
es: Mal

source: Neutral
es: Neutro

source: Good
es: Bien

source: Very Good
es: Muy bien

source: Great
es: Genial

source: Excellent
es: Excelente

source: Amazing
es: Increíble

source: Euphoric
es: Eufórico

source: Custom Selection
es: Selección Personalizada

source: Mood saved!
es: ¡Estado de ánimo guardado!

# errorSaving
source: Error saving: {error}
es: Error al guardar: {error}

source: Settings
es: Configuración

source: Dark Mode
es: Modo Oscuro

# darkModeDescription
source: Switch between light and dark theme
es: Cambiar entre tema claro y oscuro

source: Notifications
es: Notificaciones

# notificationsDescription
source: Configure daily reminders
es: Configura recordatorios diarios

source: Privacy & Security
es: Privacidad y Seguridad

# privacySecurityDescription
source: Data protection and privacy settings
es: Configuración de protección de datos y privacidad

source: Language
es: Idioma

# languageDescription
source: Change app language
es: Cambiar idioma de la aplicación

# moodNavigation
source: Mood
es: Estado de ánimo

# chartsNavigation
source: Charts
es: Gráficos

# tipsNavigation
source: Tips
es: Consejos

# settingsNavigation
source: Settings
es: Configuración

source: Record Mood Entry
es: Registrar Estado de Ánimo

# pressAndHoldToAdjust
source: Press and hold to adjust intensity
es: Mantén presionado para ajustar intensidad

# intensityLabel
source: Intensity: {intensity}/5
es: Intensidad: {intensity}/5

# score
source: Score: {score}/10
es: Puntuación: {score}/10

source: Select Language
es: Seleccionar Idioma

source: English
es: Inglés

source: Spanish
es: Español

# languageChanged
source: Language changed to {language}
es: Idioma cambiado a {language}

source: System Default
es: Predeterminado del Sistema

# moodSuccessSaved
source: Mood recorded successfully!
es: ¡Estado de ánimo registrado exitosamente!

# errorSavingMood
source: Error saving
es: Error al guardar

# energyLevelLabel
source: Energy Level
es: Nivel de Energía

# stressLevelLabel
source: Stress Level
es: Nivel de Estrés

source: Triggers
es: Disparadores

source: Add comment...
es: ¿Quieres añadir algún comentario?

# selectEmotion
source: Select an emotion
es: Selecciona una emoción

# selectActivity
source: Select an activity
es: Selecciona una actividad

# selectTrigger
source: Select a trigger
es: Selecciona un disparador

source: Additional emotions
es: Emociones adicionales

source: Common activities
es: Actividades comunes

source: Emotional triggers
es: Disparadores emocionales

source: Optional
es: Opcional

source: Work
es: Trabajo

source: Exercise
es: Ejercicio

source: Socializing
es: Socializar

source: Family
es: Familia

source: Rest
es: Descanso

source: Hobbies
es: Pasatiempos

source: Study
es: Estudiar

source: Travel
es: Viajar

source: Meditation
es: Meditación

source: Reading
es: Lectura

source: Music
es: Música

source: Nature
es: Naturaleza

source: Happy
es: Feliz

source: Sad
es: Triste

source: Anxious
es: Ansioso

source: Calm
es: Calmado

source: Excited
es: Emocionado

source: Angry
es: Enojado

source: Grateful
es: Agradecido

source: Frustrated
es: Frustrado

source: Motivated
es: Motivado

source: Tired
es: Cansado

source: Confident
es: Confiado

source: Lonely
es: Solo

source: Stress
es: Estrés

source: Work pressure
es: Presión laboral

source: Relationship
es: Relaciones

source: Health
es: Salud

source: Money
es: Dinero

source: Change
es: Cambio

source: Uncertainty
es: Incertidumbre

source: Social media
es: Redes sociales

source: Sleep
es: Sueño

source: Weather
es: Clima

source: Low
es: Bajo

source: Medium
es: Medio

source: High
es: Alto

source: Very Low
es: Muy Bajo

source: Very High
es: Muy Alto

source: Notification Settings
es: Configuración de Notificaciones

source: Enable notifications
es: Habilitar notificaciones

source: Notification time
es: Hora de notificación

source: Select time
es: Seleccionar hora

source: Test notification
es: Probar notificación

# notificationTestSent
source: Test notification sent!
es: ¡Notificación de prueba enviada!

# errorSendingTest
source: Error sending test notification
es: Error enviando notificación de prueba

source: Save Settings
es: Guardar Configuración

# settingsSaved
source: Settings saved successfully!
es: ¡Configuración guardada exitosamente!

source: Error saving settings
es: Error guardando configuración

source: Mood Distribution
es: Distribución del Estado de Ánimo

source: Weekly Mood Trend
es: Tendencia Semanal del Estado de Ánimo

source: No data available
es: No hay datos disponibles

source: Last week
es: Última Semana

source: This week
es: Esta semana

source: Average
es: Promedio

source: entries
es: entradas

source: Select date
es: Seleccionar fecha

source: days ago
es: días atrás

source: from
es: desde

source: to
es: hasta

source: Daily average
es: Promedio diario

source: Period summary
es: Resumen del período

source: Loading...
es: Cargando...

source: Retry
es: Reintentar

source: No entries found
es: No se encontraron entradas

# addFirstEntry
source: Add your first mood entry!
es: ¡Agrega tu primera entrada de estado de ánimo!

source: Tap + to add
es: Toca + para agregar

source: How are you feeling today?
es: ¿Cómo te sientes hoy?

# timeForDailyMoodCheck
source: It's time for your daily mood check
es: Es hora de registrar tu estado de ánimo diario

source: Daily Mood Reminder
es: Recordatorio Diario de Estado de Ánimo

# dailyRemindersToTrackMood
source: Daily reminders to track your mood
es: Recordatorios diarios para registrar tu estado de ánimo

source: Data Protection
es: Protección de Datos

# localStorageInfo
source: Your data is stored locally on your device and is not shared with third parties.
es: Tus datos se almacenan localmente en tu dispositivo y no se comparten con terceros.

source: Export Data
es: Exportar Datos

source: Delete All Data
es: Eliminar Todos los Datos

# confirmDeleteTitle
source: Confirm Deletion
es: Confirmar Eliminación

# confirmDeleteMessage
source: Are you sure you want to delete all your mood data? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar todos tus datos de estado de ánimo? Esta acción no se puede deshacer.

source: Delete
es: Eliminar

source: Mood History
es: Historial del Estado de Ánimo

# todayMood
source: Today's Mood
es: Estado de Ánimo de Hoy

source: Weekly Average
es: Promedio Semanal

source: Monthly Trend
es: Tendencia Mensual

source: How are you feeling?
es: ¿Cómo te sientes?

source: Notes
es: Notas

# addNotesPlaceholder
source: Add notes about your mood...
es: Agrega notas sobre tu estado de ánimo...

source: Save Mood
es: Guardar Estado

source: Home
es: Inicio

source: Tips
es: Consejos

source: Charts
es: Gráficos

# notificationPermissionDenied
source: Notification permissions denied. Go to settings to enable them.
es: Permisos de notificación denegados. Ve a configuración para habilitarlos.

# dailyReminderScheduledFor
source: Daily reminder scheduled for {time}
es: Recordatorio diario programado para las {time}

# reminderUpdatedFor
source: Reminder updated for {time}
es: Recordatorio actualizado para las {time}

source: Daily reminder canceled
es: Recordatorio diario cancelado

# dailyReminderTitle
source: Daily Reminder
es: Recordatorio Diario

# dailyReminderDescription
source: Get a daily reminder to track your mood
es: Recibe un recordatorio diario para registrar tu estado de ánimo

source: Enable reminders
es: Habilitar recordatorios

# remindersActive
source: Reminders are active
es: Los recordatorios están activos

# remindersInactive
source: Reminders are inactive
es: Los recordatorios están desactivados

source: Reminder Schedule
es: Horario del Recordatorio

# selectReminderTime
source: Select the time you want to receive the reminder
es: Selecciona la hora en que quieres recibir el recordatorio

source: Reminder time
es: Hora del recordatorio

source: Information
es: Información

# reminderInfoText
source: • Reminders will be sent every day at the selected time\n• You can change the time at any moment\n• If you disable reminders, all scheduled notifications will be canceled\n• Make sure you have notification permissions enabled on your device
es: • Los recordatorios se enviarán todos los días a la hora seleccionada\n• Puedes cambiar la hora en cualquier momento\n• Si desactivas los recordatorios, se cancelarán todas las notificaciones programadas\n• Asegúrate de tener los permisos de notificación habilitados en tu dispositivo

source: Existing entry
es: Entrada existente

# overwriteEntry
source: You already have a score for today. Overwrite?
es: Ya tienes una puntuación para hoy. ¿Sobrescribir?

source: Overwrite
es: Sobrescribir

source: Mood saved correctly
es: Estado guardado correctamente

source: My Current Mood
es: Mi Estado Actual

source: Useful Tips
es: Consejos Útiles

# breathingTipTitle
source: Do 5 minutes of deep breathing
es: Haz 5 minutos de respiración profunda

# breathingTipDescription
source: Relaxation technique to reduce stress
es: Técnica de relajación para reducir el estrés

# breathingTipStep1
source: Sit in a comfortable position
es: Siéntate en posición cómoda

# breathingTipStep2
source: Place one hand on your chest and another on your abdomen
es: Coloca una mano en tu pecho y otra en el abdomen

# breathingTipStep3
source: Breathe deeply for 4 seconds
es: Inhala profundamente por 4 segundos

# breathingTipStep4
source: Exhale slowly for 6 seconds
es: Exhala lentamente durante 6 segundos

# breathingTipStep5
source: Repeat for 5 minutes
es: Repite durante 5 minutos

# walkTipTitle
source: Go for a walk outdoors
es: Sal a caminar al aire libre

# walkTipDescription
source: Reconnect with nature and clear your mind
es: Reconecta con la naturaleza y despeja tu mente

# walkTipStep1
source: Choose a nearby park or natural area
es: Elige un parque o área natural cercana

# walkTipStep2
source: Walk at a moderate pace
es: Camina a ritmo moderado

# walkTipStep3
source: Observe your surroundings
es: Observa tu entorno

# walkTipStep4
source: Breathe deeply
es: Respira profundamente

# walkTipStep5
source: Disconnect from electronic devices
es: Desconéctate de dispositivos electrónicos

# gratitudeTipTitle
source: Write three things you're grateful for
es: Escribe tres cosas por las que estés agradecido

# gratitudeTipDescription
source: Practice gratitude to improve your emotional perspective
es: Practica la gratitud para mejorar tu perspectiva emocional

# gratitudeTipStep1
source: Take a notebook or open a notes app
es: Toma un cuaderno o abre una app de notas

# gratitudeTipStep2
source: Write three things that make you feel grateful
es: Escribe tres cosas que te hagan sentir agradecido

# gratitudeTipStep3
source: Be specific and reflect on why they make you feel good
es: Sé específico y reflexiona sobre por qué te hacen sentir bien

# gratitudeTipStep4
source: Repeat this practice daily
es: Repite esta práctica diariamente

# callTipTitle
source: Call a friend or family member
es: Llama a un amigo o familiar

# callTipDescription
source: Strengthen social connections to improve your mood
es: Fortalece conexiones sociales para mejorar tu ánimo

# callTipStep1
source: Choose someone you feel comfortable with
es: Elige a alguien con quien te sientas cómodo

# callTipStep2
source: Call them or send a voice message
es: Llámale o envíale un mensaje de voz

# callTipStep3
source: Share how you feel
es: Comparte cómo te sientes

# callTipStep4
source: Listen actively to their response
es: Escucha activamente su respuesta

# callTipStep5
source: Thank them for their support
es: Agradece por su apoyo

# mindfulnessTipTitle
source: Practice mindfulness for 10 minutes
es: Practica mindfulness durante 10 minutos

# mindfulnessTipDescription
source: Focus on the present moment to reduce anxiety
es: Enfócate en el momento presente para reducir la ansiedad

# mindfulnessTipStep1
source: Sit with an upright posture
es: Siéntate con postura erguida

# mindfulnessTipStep2
source: Focus on your natural breathing
es: Enfócate en tu respiración natural

# mindfulnessTipStep3
source: Observe thoughts without judging
es: Observa pensamientos sin juzgar

# mindfulnessTipStep4
source: Use a sensory anchor (sounds, sensations)
es: Usa un ancla sensorial (sonidos, sensaciones)

# mindfulnessTipStep5
source: Gently return to the present when your mind wanders
es: Vuelve suavemente al presente cuando divagues

# screenBreakTipTitle
source: Take a break away from screens
es: Toma un descanso lejos de pantallas

# screenBreakTipDescription
source: Disconnect from devices to reduce visual fatigue
es: Desconéctate de dispositivos para reducir la fatiga visual

# screenBreakTipStep1
source: Find a quiet place
es: Busca un lugar tranquilo

# screenBreakTipStep2
source: Close your eyes and breathe deeply
es: Cierra los ojos y respira profundamente

# screenBreakTipStep3
source: Stretch your neck and shoulders
es: Estira el cuello y hombros

# screenBreakTipStep4
source: Take a short walk if possible
es: Haz una caminata corta si es posible

# screenBreakTipStep5
source: Return to your activities with a clear mind
es: Vuelve a tus actividades con la mente despejada

# musicTipTitle
source: Listen to relaxing music
es: Escucha música relajante

# musicTipDescription
source: Use music to calm your mind and body
es: Utiliza la música para calmar tu mente y cuerpo

# musicTipStep1
source: Choose a relaxing playlist or album
es: Elige una lista de reproducción o álbum relajante

# musicTipStep2
source: Find a comfortable place to sit or lie down
es: Encuentra un lugar cómodo para sentarte o acostarte

# musicTipStep3
source: Close your eyes and focus on the music
es: Cierra los ojos y concéntrate en la música

# musicTipStep4
source: Allow the music to envelop and relax you
es: Permite que la música te envuelva y te relaje

# musicTipStep5
source: Enjoy the moment without distractions
es: Disfruta del momento sin distracciones

# stretchTipTitle
source: Practice gentle stretches
es: Practica estiramientos suaves

# stretchTipDescription
source: Relieve muscle tension and improve circulation
es: Alivia la tensión muscular y mejora la circulación

# stretchTipStep1
source: Find a comfortable space
es: Encuentra un espacio cómodo

# stretchTipStep2
source: Perform neck, shoulder, and back stretches
es: Realiza estiramientos de cuello, hombros y espalda

# stretchTipStep3
source: Hold each stretch for 15-30 seconds
es: Mantén cada estiramiento durante 15-30 segundos

# stretchTipStep4
source: Breathe deeply while stretching
es: Respira profundamente mientras te estiras

# stretchTipStep5
source: Repeat as needed
es: Repite según sea necesario

# hobbyTipTitle
source: Dedicate time to a hobby you enjoy
es: Dedica tiempo a un hobby que disfrutes

# hobbyTipDescription
source: Do an activity you're passionate about to improve your mood
es: Realiza una actividad que te apasione para mejorar tu estado de ánimo

# hobbyTipStep1
source: Choose a hobby you like (reading, painting, cooking)
es: Elige un hobby que te guste (leer, pintar, cocinar)

# hobbyTipStep2
source: Dedicate at least 30 minutes to this activity
es: Dedica al menos 30 minutos a esta actividad

# hobbyTipStep3
source: Allow yourself to enjoy without distractions
es: Permítete disfrutar sin distracciones

# hobbyTipStep4
source: Reflect on how you feel when finished
es: Reflexiona sobre cómo te sientes al finalizar

# waterTipTitle
source: Drink water to stay hydrated
es: Bebe agua para mantenerte hidratado

# waterTipDescription
source: Hydration is key to physical and mental wellbeing
es: La hidratación es clave para el bienestar físico y mental

# waterTipStep1
source: Fill a glass or bottle with fresh water
es: Llena un vaso o botella con agua fresca

# waterTipStep2
source: Take small, constant sips
es: Bebe sorbos pequeños y constantes

# waterTipStep3
source: Pay attention to how you feel when hydrating
es: Presta atención a cómo te sientes al hidratarte

# waterTipStep4
source: Repeat whenever you feel thirsty
es: Repite cada vez que sientas sed

# affirmationTipTitle
source: Repeat a positive affirmation out loud
es: Repite una afirmación positiva en voz alta

# affirmationTipDescription
source: Reinforce your self-esteem and confidence
es: Refuerza tu autoestima y confianza

# affirmationTipStep1
source: Choose a positive affirmation (e.g., 'I am capable and valuable')
es: Elige una afirmación positiva (ej. "Soy capaz y valioso")

# affirmationTipStep2
source: Find a quiet place to concentrate
es: Encuentra un lugar tranquilo para concentrarte

# affirmationTipStep3
source: Repeat the affirmation out loud several times
es: Repite la afirmación en voz alta varias veces

# affirmationTipStep4
source: Visualize the meaning of the affirmation
es: Visualiza el significado de la afirmación

# affirmationTipStep5
source: Feel how it empowers you
es: Siente cómo te empodera

# goalTipTitle
source: Set a small daily goal and celebrate it
es: Organiza una pequeña meta diaria y celébrala

# goalTipDescription
source: Establish an achievable objective to improve your motivation
es: Establece un objetivo alcanzable para mejorar tu motivación

# goalTipStep1
source: Define a simple goal
es: Define una meta simple

# goalTipStep2
source: Divide it into small steps
es: Divídela en pasos pequeños

# goalTipStep3
source: Set a realistic deadline
es: Establece un plazo realista

# goalTipStep4
source: Achieve the goal and recognize your accomplishment
es: Alcanza la meta y reconoce tu logro

# goalTipStep5
source: Celebrate with something you enjoy
es: Celebra con algo que disfrutes

# helpTipTitle
source: Offer help to someone who needs it
es: Ofrece ayuda a alguien que lo necesite

# helpTipDescription
source: Altruism to generate mutual wellbeing
es: Altruismo para generar bienestar mutuo

# helpTipStep1
source: Identify someone who needs support
es: Identifica a alguien que necesite apoyo

# helpTipStep2
source: Offer your help genuinely
es: Ofrece tu ayuda de manera genuina

# helpTipStep3
source: Listen to their needs and concerns
es: Escucha sus necesidades y preocupaciones

# helpTipStep4
source: Provide your support in the best way possible
es: Brinda tu apoyo de la mejor manera posible

# helpTipStep5
source: Reflect on how you feel when helping
es: Reflexiona sobre cómo te sientes al ayudar

# organizeTipTitle
source: Organize a space in your home
es: Ordena un espacio de tu hogar

# organizeTipDescription
source: Organize an area to reduce mental clutter
es: Organiza un área para reducir el desorden mental

# organizeTipStep1
source: Choose a small space (desk, closet)
es: Elige un espacio pequeño (escritorio, armario)

# organizeTipStep2
source: Remove everything unnecessary
es: Retira todo lo innecesario

# organizeTipStep3
source: Organize what remains functionally
es: Organiza lo que queda de manera funcional

# organizeTipStep4
source: Clean the area for greater clarity
es: Limpia el área para mayor claridad

# organizeTipStep5
source: Enjoy the new order
es: Disfruta del nuevo orden

# petTipTitle
source: Pet an animal or plant
es: Acaricia a una mascota o planta

# petTipDescription
source: Connection with living beings to reduce stress
es: Conexión con seres vivos para reducir estrés

# petTipStep1
source: Look for your pet or a nearby plant
es: Busca a tu mascota o una planta cercana

# petTipStep2
source: Take a moment to pet it gently
es: Tómate un momento para acariciarla suavemente

# petTipStep3
source: Observe their reactions and enjoy the moment
es: Observa sus reacciones y disfruta del momento

# petTipStep4
source: Breathe deeply while interacting
es: Respira profundamente mientras interactúas

# petTipStep5
source: Be grateful for the company they provide
es: Agradece por la compañía que te brindan

# skyTipTitle
source: Observe the sky
es: Observa el cielo

# skyTipDescription
source: Connect with nature and relax your mind
es: Conéctate con la naturaleza y relaja tu mente

# skyTipStep1
source: Find a comfortable place outdoors
es: Encuentra un lugar cómodo al aire libre

# skyTipStep2
source: Look up and observe the clouds or stars
es: Mira hacia arriba y observa las nubes o estrellas

# skyTipStep3
source: Breathe deeply and relax
es: Respira profundamente y relájate

# skyTipStep4
source: Allow your mind to wander while observing
es: Permite que tu mente divague mientras observas

# skyTipStep5
source: Enjoy the calm that the sky brings you
es: Disfruta de la calma que te brinda el cielo

# socialMediaTipTitle
source: Disconnect from social media for an hour
es: Desconéctate de redes sociales por una hora

# socialMediaTipDescription
source: Reduce information overload and improve your wellbeing
es: Reduce la sobrecarga de información y mejora tu bienestar

# socialMediaTipStep1
source: Set an alarm for one hour
es: Configura una alarma para una hora

# socialMediaTipStep2
source: Close all social media applications
es: Cierra todas las aplicaciones de redes sociales
