Repository: davidfvaquero/mood_tracker
Catalog: lib/l10n/app_*.arb
Languages: es

# socialMediaTipStep3
source: Activate airplane mode or silence notifications
es: Activa modo avión o silencia notificaciones

# socialMediaTipStep4
source: Dedicate this time to offline activities (reading, meditating)
es: Dedica este tiempo a actividades offline (leer, meditar)

# socialMediaTipStep5
source: Reflect on how you feel when disconnecting
es: Reflexiona sobre cómo te sientes al desconectarte

# visualizeTipTitle
source: Visualize a place that brings you peace
es: Visualiza un lugar que te transmita paz

# visualizeTipDescription
source: Use visualization to reduce anxiety
es: Utiliza la visualización para reducir la ansiedad

# visualizeTipStep1
source: Find a quiet place to sit
es: Encuentra un lugar tranquilo para sentarte

# visualizeTipStep2
source: Close your eyes and breathe deeply
es: Cierra los ojos y respira profundamente

# visualizeTipStep3
source: Imagine a place that makes you feel at peace (beach, forest)
es: Imagina un lugar que te haga sentir en paz (playa, bosque)

# visualizeTipStep4
source: Visualize the details: sounds, smells, sensations
es: Visualiza los detalles: sonidos, olores, sensaciones

# visualizeTipStep5
source: Allow that feeling of peace to envelop you
es: Permite que esa sensación de paz te envuelva

# recipeTipTitle
source: Try a new healthy recipe
es: Prueba una nueva receta saludable

# recipeTipDescription
source: Therapeutic cooking to stimulate creativity
es: Cocina terapéutica para estimular creatividad

# recipeTipStep1
source: Choose nutritious ingredients
es: Elige ingredientes nutritivos

# recipeTipStep2
source: Focus on the process, not just the result
es: Enfócate en el proceso, no solo en el resultado

# recipeTipStep3
source: Experiment with combinations
es: Experimenta con combinaciones

# recipeTipStep4
source: Enjoy the food mindfully
es: Disfruta la comida conscientemente

# relaxationCategory
source: Relaxation
es: Relajación

# exerciseCategory
source: Exercise
es: Ejercicio

# restCategory
source: Rest
es: Descanso

# leisureCategory
source: Leisure
es: Ocio

# healthCategory
source: Health
es: Salud

# emotionalCategory
source: Emotional
es: Emocional

# productivityCategory
source: Productivity
es: Productividad

# creativityCategory
source: Creativity
es: Creatividad

# duration1hour
source: 1 hour
es: 1 hora

source: Emotions, activities and more
es: Emociones, actividades y más

source: Just mood state
es: Solo estado de ánimo

source: Your day so far
es: Tu día hasta ahora

# energyWithValue
source: Energy: {value}/5
es: Energía: {value}/5

# emotionsWithList
source: Emotions: {emotions}
es: Emociones: {emotions}

# activitiesWithList
source: Activities: {activities}
es: Actividades: {activities}

# todayAt
source: Today {time}
es: Hoy {time}

# yesterdayAt
source: Yesterday {time}
es: Ayer {time}

source: Mood state registered successfully!
es: ¡Estado de ánimo registrado exitosamente!

source: General Mood State
es: Estado de Ánimo General

# selectEmotionsAndIntensity
source: Select the emotions you feel and their intensity (1-5)
es: Selecciona las emociones que sientes y su intensidad (1-5)

# energyLevelWithValue
source: Energy Level: {level}/5
es: Nivel de Energía: {level}/5

# stressLevelWithValue
source: Stress Level: {level}/5
es: Nivel de Estrés: {level}/5

# selectActivitiesYouDid
source: Select the activities you did
es: Selecciona las actividades que realizaste

# holdToPressToAdjustIntensity
source: Hold to adjust intensity
es: Mantén presionado para ajustar intensidad

# scoreWithValue
source: Score: {score}/10
es: Puntuación: {score}/10

# additionalNotesTitle
source: Additional Notes
es: Notas Adicionales

# intensityWithValue
source: Intensity: {intensity}/5
es: Intensidad: {intensity}/5

source: Save Mood State
es: Guardar Estado de Ánimo

# quickCheckinTitle
source: Quick Check-in
es: Check-in Rápido

# fastCheckTitle
source: Fast
es: Rápido

# errorSavingWithMessage
source: Error saving: {error}
es: Error al guardar: {error}

# aboutQuickCheckinTitle
source: About Quick Check-in
es: Sobre el Check-in Rápido

# quickCheckinDetails
source: • Record your mood in seconds\n • Perfect for multiple daily entries\n• Use quick buttons or customize your selection\n• You can add more details later if you want
es: • Registra tu estado de ánimo en segundos\n• Perfecto para múltiples entradas diarias\n• Usa los botones rápidos o personaliza tu selección\n• Puedes agregar más detalles después si quieres

# customSelectionTitle
source: Custom Selection
es: Selección Personalizada

# saveMoodStateTitle
source: Save Mood State
es: Guardar Estado de Ánimo
